{"announcements":[{"title":"DAILY BULLETIN–TUESDAY–NOVEMBER 14, 2017","content":""},{"title":"DAY 6","content":""},{"title":"Advisory and Lunch","content":" 11:15–11:45Lunch for Grades 11 and 12 11:50–12:10Advisory for Grades 11 and 12"},{"title":"11:15","content":"–11:35Class Mtg (Brauer) for Grade & Advisory for Grade 10 11:40–12:10Lunch for Grades 9 and 10"},{"title":"ACTIVITIES PERIOD MEETINGS:","content":" 12:55pm-1:40pm: MeetingSponsorLocation Field Hockey (JV & Varsity)*MittlerMcDonnell Gym Film Room Blankets for BabiesWhite/ScheerBlanke Room Fellowship of Christian AthletesMacam/CocoSTEM 258 Programming ClubGawSTEM 252 Robotics Club (co-ed)MenghiniSTEM 14 GSAElliott/CrumbCollege Counseling Library Heroes InitiativeCoxSTEM 216 Math TeamChangSTEM 118 Anatomy ClubBradfordSTEM 112 Debate TeamMahaffeyOlson 221 Ultimate FrisbeeToddField 7"},{"title":"1:20pm-1:40pm","content":" MeetingSponsorLocation MICDS Health ClubFoxUS Office Conference Room"},{"title":"*FIELD HOCKEY TEAMS (Varsity and JV)","content":": Please come to the McDonnell Gym film room to return your uniforms today during Activities period. If you have a meeting, please give your complete uniform (including jacket) to a teammate to return for you. Thanks!"},{"title":"GRADE 12:","content":"Report to the US Gym at 12:10pm and wear tennis shoes."},{"title":"PRACTICE ACT TOMORROW","content":": GRADE 10: All sophomores will take the practice ACT this Wednesday, November 15 and are excused from morning classes. Regardless of Late Start day--Standard time test takers, please report to Orthwein Theater by 7:45 a.m., as testing begins promptly at 8:00 a.m.  You should be finished by noon.  Extended time students will need to be in the College Counseling Conference Room or the Language Lab by 7:30 a.m. (the test will start at 7:45 a.m.).  Testing should conclude by 12:45.  All sophomores are expectedto eat lunch immediately following the test and then resume their schedule as normal. EVERYONE: Please be as quiet as possible near Orthwein, the Language Lab, and the College Counseling Conference Room for the duration of the testing."},{"title":"TURKEY TRAIN","content":":  Next Monday, November 20, is our annual Turkey Train!  Please drop off your 10-12 pound frozen turkey in Founders Court before school.  After heading to advisory at 8am, all students should line up alphabetically by advisory along the walkway from Founders Courtto the MAC, beginning with freshmen and ending with seniors at the MAC.  Please look for your advisory name on the cones along the route.  Remember-dress appropriately for the weather, but most importantly, be sure to wear warm, waterproof gloves!"},{"title":"SCRABBLE & TEA","content":": meets this Wednesday afternoon, from 3:30-4:30, in Mr. Terrell's room. Animal crackers provided."}],"birthdays":{},"dayType":"","jeansDay":false}