{"announcements":[{"title":"Final Day for T1 Graded Work","content":""},{"title":"RAM-FAMS RETURNING!!","content":"On Monday, November 13th we will have advisory period in Ram-Fam locations in Ram-Fam groups. The time will be spent deciding on a team name for a Ram-Fam Trivia Contest being held in December. Locations will be the same as for the Ram-Fam kick-off event at the start of the year, but check the bulletin on Monday if you need a reminder."},{"title":"STUDENTS","content":"All graded work must be submitted by today at 3:30 p.m. to the appropriate teacher. Any work submitted after 3:30 p.m. will not be graded. To reiterate: No work will be accepted after 3:30 p.m. today."},{"title":"THE ANNUAL FUND NEEDS YOUR HELP!","content":"We are hosting a Student Thank-a-thon on Tuesday, November 14 during lunch in the Olson Hall Presentation Room. Bring your laptops and be ready to thank our donors via email for their generous support of MICDS. It's SUPER EASY, fun, and we provide you with pizza, snacks, and drinks! All are welcome and Community Service credits can be earned. We encourage you to RSVP to Laurie Nest at lnest@micds.orgby Monday, November 13 at noon, so we can ensure there is enough food. We hope to see you there!"},{"title":"WARM UP ST. LOUIS","content":"We are collecting gently used or new winter coats and new gloves, mittens, scarves, hats, and socks through Wednesday, December 20. Adult items will go to veterans and homeless served by St. Patrick Center, and youth items (size 4 child through adult) will go to Children's Hospital's Healthy Kids Express Vans and The Little Bit Foundation. Let's help warm up St. Louis!"},{"title":"LOVE MICDS?","content":"Student panels are needed for interview days beginning now!  Monday through Thursday afternoons from approximately 4:15 until 5:00 p.m. Flexible schedule.  Apply today!  The time you spend helping prospective students and their families learn more about MICDS will count toward your volunteer requirement.  Contact Ms. Wildman (kwildman@micds.org) for more information."}],"birthdays":{"Today":["Rishi Anand and Lizzy Reisinger"],"Friday":["Will Bohlmann","and Lucy Zhao"],"Saturday":["Chase Bouchein","Will Falk","Quentin Intagliata","and Henry Mikula"]},"dayType":"END OF T1","jeansDay":true}