{"announcements":[{"title":"FREE 1 PERIOD?","content":"stIf you are free during the first period of the day (A Block on Days 1, 2, 4, and 5 and B Block on Days 3 and 6), you must check in with Mr. Calise in the Upper School Office EVERYday. Failure to do so will be reported to your Dean! All grades must check in by 8:45am on regular Days 1 and 4 and9:30am on regular Days 2, 3, 5, and 6.On Late Start days, students must check in by 9:30am. More than two missed  or (unexcused) late sign-ins will result in a forfeiture of your privileges!"},{"title":"“1984”","content":"The Upper School Drama Program presents George Orwell's \"1984\" this weekend. Performances are at 8pm on Friday and Saturday and 2pm on Sunday.  Tickets are available at Upper School lunch or at the bookstore. ALL HAIL BIG BROTHER!"},{"title":"WARM UP ST. LOUIS","content":"We are collecting gently used or new winter coats and new gloves, mittens, scarves, hats, and socks through Wednesday, December 20. Adult items will go to veterans and homeless served by St. Patrick Center, and youth items (size 4 child through adult) will go to Children's Hospital's Healthy Kids Express Vans and The Little Bit Foundation. Let's help warm up St. Louis!"},{"title":"TURKEY TRAIN","content":"Next Monday, November 20, is our annual Turkey Train!  Please drop off your 10-12 pound frozen turkey in Founders Court before school.  After heading to advisory at 8am, all students should line up alphabetically by advisory along the walkway from Founders Court to the MAC, beginning with freshmen and ending with seniors at the MAC.  Please look for your advisory name on the cones along the route.  Remember -dress appropriately for the weather, but most importantly;be sure to wear warm, waterproof gloves!"},{"title":"PRACTICE ACT TODAY","content":"GRADE 10: All sophomores will take the practice ACT this Wednesday, November 15 and are excused from morning classes. Regardless of Late Start day --Standard time test takers, please report to Orthwein Theater by 7:45 a.m., as testing begins promptly at 8:00 a.m.  You should be finished by noon.  Extended time students will need to be in the College Counseling Conference Room or the Language Lab by 7:30 a.m. (the test will start at 7:45 a.m.).  Testing should conclude by 12:45.  All sophomores are expectedto eat lunch immediately following the test and then resume their schedule as normal. EVERYONE: Please be as quiet as possible near Orthwein, the Language Lab, and the College Counseling Conference Room for the duration of the testing."},{"title":"SCRABBLE & TEA","content":"meets this afternoon, from 3:30-4:30, in Mr. Terrell's room. Animal crackers provided."}],"birthdays":{"Today":["Rahman Almousalli and Katherine Rianhard"]},"dayType":"LATE START","jeansDay":false}