{"nnouncements":[{"title":"HELPING HANDS:","content":" Our annual school-wide holiday toy drive is underway! To participate, visit the display in the US May office hallway and select a tag with a wish item. Return the unwrapped gift, with the wish tag attached, to the collection area by December 8. Participate on your own, with friends, or with your advisory! Gifts will go to Family Forward for their \"Shop for an Angel\" program. For more information, please see the display area or contact Mrs. Hamill."},{"title":"“ SHE'S THE FIRST” BAKE SALE","content":" : Thank you to all of our bakers and for everyone who supported the bake sale today. We raised $437.55 to benefit girls' education in developing countries. Thank you for your support!"},{"title":"ON THIS DATE:","content":" The movie, Frozen opened on this date in 2013-”Let It Go!” The famed PENN STATION opens on this date in NYC in 1910. The first ever MACY’S THANKSGIVING DAY PARADE debuts on this date in 1924. In 1895 on this date, Alfred Nobel signs his last will establishing the NOBEL PRIZE. P enny Ann Early became the first woman to play major professional basketball, for the Kentucky Colonels in an ABA game against the Los Angeles Stars in 1968. In 1973 Twenty-fifth Amendment : The United States Senate votes 92–3 to confirm Gerald Ford as Vice President of the United States . (On December 6 , the House will confirm him 387–35). Famous Birthdays: Kathryn Bigelow, Jimi Hendrix, Bruce Lee, Bill Nye, Caroline Kennedy, Robin Givens, Twista, Jaleel White, Michael Floyd, Misato Nagano, Professor Green."},{"title":"UPCOMING IMPORTANT DATES:","content":" Hanukkah begins the evening of December 12th through December 20th. Winter Break begins December 21st through January 4th. Christmas Day, December 25th. Kwanzaa, December 26th through January 1st. New Year’s Day, January 1st."},{"title":"LUNCH :","content":" BBQ Chicken Thighs, Baked Beans, Roasted Brussel Sprouts, Spinach and Cheese Stuffed Portobello (Main Entree), Pepperoni Pizza (Action Station), Southwest Vegetable (Soup), Strawberries with Whipped Topping (Dessert)"}],"birthdays":{"Today":["Shammah Bishut and Erik Kuznetsov"]},"dayType":"","jeansDay":false}