{"announcements":[{"title":"DAILY BULLETIN – MONDAY – NOVEMBER 20, 2017","content":""},{"title":"DAY 4 - TURKEY TRAIN","content":""},{"title":"TODAY IS A JEANS DAY (w/regular dress code or MICDS spirit wear. Dress warmly for the Turkey Train--bring waterproof gloves!)","content":""},{"title":"JUNIORS/SENIORS:","content":" Parking in A-lot might be crowded due to the Turkey Train and another parent meeting. Please plan to arrive oncampus early if you want to be guaranteed a spot in A-lot. If A-lot is full when you arrive, you must drive to C-lot, although you can certainlydrop off your frozen turkey in the Breezeway before you move your car. Do not park on the curb."},{"title":"TURKEY TRAIN","content":" : Today is the big day! Please drop off your 10-12 pound frozen turkey in Founders Court before school. After heading toadvisory at 8am, all students should line up alphabetically by advisory along the walkway from Founders Court to the MAC, beginning withfreshmen and ending with seniors at the MAC. Please look for your advisory name on the cones along the route. Remember - dressappropriately for the weather, but most importantly, be sure to wear warm, waterproof gloves!"},{"title":"FIELD TRIP :","content":"10:30am - 2:45pm: Playback Theatre to Freeman Arts Center in Middle School10:55am - 1:45pm: Performers and Tech Staff for “1984” Matinee11:30am-1:30pm: Grade 12, Utopia/Dystopia to Orthwein"},{"title":"ADDING/DROPPING CLASSES :","content":" The last day that you may drop or add a class is Wednesday, November 29. The paper work must be finishedby the end of the school day. The result of dropping a class after this deadline is a W (withdrawal) on your transcript."},{"title":"BLOOD DRIVE TOMORROW","content":" : Don’t forget to sign up to participate in the blood drive in the US Gym tomorrow from 7:30am - 12:30pm.Students who are 16 years or older (and weigh 115 pounds or more) must complete a permission slip and turn it into Nurse Fox before theywill be allowed to schedule an appointment. Adults do not need a permission slip but should schedule an appointment in advance. Everyoneplanning to participate should eat a healthy dinner and breakfast and drink plenty of water."},{"title":"GRAND TETONS & YELLOWSTONE ADVENTURE JULY 15-21, 2018 -","content":" Travel to Wyoming this summer to learn about geology andbiodiversity of the Grand Tetons and Yellowstone. All participants will receive one trimester of high school elective science credit forparticipating, completing a detailed research project, and keeping daily journals and notes. Join us to learn more at an informational meetingon Thursday, December 7, 2017 from 6pm-7pm in STEM Building Room 108 and contact Mrs. Hamill or Mrs. Bradford with questions or foran application. Applications are due to Mrs. Hamill on Friday, December 15, 2017."},{"title":"BREAK A LEG WISHES TO THE CAST AND CREW OF “ 1984” 1984 ALL HAIL BIG BROTHER!","content":" : The Upper School Drama Program presents George Orwell's \" \" thisweekend. Performances are at 8pm on Friday and Saturday and 2pm on Sunday."},{"title":"DAY 4 REDUX :","content":" This is a reminder that Tuesday (November 21st) is also a Day 4. Last day of the week, so it is a JEANS DAY!"},{"title":"TURKEY DAY TRIVIA :","content":" Gobble, gobble?: Not so fast. Only male turkeys, called toms, gobble . Females, called hens, cackle."},{"title":"Do you have a MUST SEE “Thanksgiving” movie? Do you watch the MACY’S Day Parade each year? Do you have a","content":""},{"title":"cool tradition or favorite anecdote? Email Mr. Shaw at: lshaw@micds.org and share your movie, tradition, or","content":""},{"title":"anecdote about Thanksgiving and it could end up in the Nov. 21st bulletin!","content":""}],"birthdays":{},"dayType":"TURKEY TRAIN","jeansDay":true}