{"announcements":[{"title":"WARM UP ST. LOUIS","content":"We are collecting gently used or new winter coats and new gloves, mittens, scarves, hats, and socks through Wednesday, December 20. Adult items will go to veterans and homeless served by St. Patrick Center, and youth items (size 4 child through adult) will go to Children's Hospital's Healthy Kids Express Vans and The Little Bit Foundation. Let's help warm up St. Louis!"},{"title":"ANNUAL FUND NEEDS YOUR HELP","content":"We are hosting a Student Thank-a-thon onThursday, December 7 during lunch in the Olson Hall Presentation Room. Bring your laptops and be ready to thank our donors via email for their generous support of MICDS. It's SUPER EASY, fun, and weprovide you with pizza, snacks, and drinks! All are welcome and Community Service credits can be earned. We encourage you to RSVP to Laurie Nest at lnest@micds.orgby Wednesday, Dec. 6 by noon, so we can ensure there is enough food. We hope to see you there!"},{"title":"PLEASE NOTE","content":"Please be aware that McDonnell & Brauer Hall will be closed for an event on Tuesday, December 5thstarting at 5:00 p.m. Please be sure to take all of your personal itemswith you when exiting the building."},{"title":"GRAND TETONS & YELLOWSTONE ADVENTURE","content":"July 15-21, 2018 -Travel to Wyoming this summer to learn about geology and biodiversity of the Grand Tetons and Yellowstone. All participants will receive one trimester of high school elective sciencecredit for participating, completing a detailed research project, and keeping daily journals and notes.  Join us to learn more at an informational meeting on Thursday, December 7, 2017 from 6pm-7pm in STEM Building Room 108 and contact Mrs. Hamill or Mrs. Bradford with questions or for an application.  Applications are due to Mrs. Hamill on Friday, December 15, 2017."},{"title":"HELPING HANDS","content":"Our annual school-wide holiday toy drive is underway!  To participate, visit the display in the US May office hallway and select a tag with a wish item.  Return the unwrapped gift, with the wish tag attached, to the collection area by this Friday, December 8. Participate on your own, with friends, or with your advisory!  Gifts will go to FamilyForward for their \"Shop for an Angel\" program.  For more information, please see the display area or contactMrs. Hamill."},{"title":"NURSE FOX SAYS","content":"Hello and happy flu season!  There have been several reported cases of influenza this week in the upper school.  This is a friendly reminder to wash your hands or use an alcohol based hand sanitizer.  Also, remember to cover your coughs and/or sneezes.  Lastly, check out this link (www.cdc.gov/flu/keyfacts.htm) regarding key facts about the flu.  If you have questions or concerns please feel free to reach out."},{"title":"HOUR OF CODE","content":"The Hour of Code is coming!  Join us Thursday, Dec 7thfrom 3:30 to 5:00 in STEM 258 as we join the national Hour of Code event where students of all programming abilities learn to program.  We'll have tutorials so bring your computer.  No coding experience needed.  We'll have food, sodas, and tons of fun.  Email Ms. Purdy (jpurdy@micds.org) if you have any questions."},{"title":"ON THIS DATE","content":"1674–FatherJacques Marquettefounds a mission on the shores of Lake Michiganto minister to the Illiniwek. (The mission would later grow into the city of Chicago.) 1783–At Fraunces Tavernin New York City, U.S. General George Washingtonbids farewell to his officers. 1791–The first edition of The Observer, the world's first Sunday newspaper, is published. 1881–The first edition of the Los Angeles Timesis published. 1909–The Montreal Canadiensice hockeyclub, the oldest surviving professional hockey franchise in the world, is founded as a charter member of the National Hockey Association. 1954–The first Burger Kingis opened in Miami. 1956–The Million Dollar Quartet(Elvis Presley, Jerry Lee Lewis, Carl Perkins, and Johnny Cash) get together at Sun Studiofor the first and last time. 1998– The Unity Module, the second module of the International Space Station, is launched.FAMOUS BIRTHDAYS:Tyra Banks-American model, actress, and producer. Jay Z-American rapper, producer, and actor, co-founded Roc-A-Fella Records. Fred Armisen-American actor and musician. Marisa Tomei-American actress.Wink Martindale-American game show host and producer.Orlando Brown-American actor and rapper. Martell Webster-American basketball player. Yeng Constantino-Filipina singer and songwriter."}],"birthdays":{"Today":["Gini Howell","Joe Li","Aanjaneyaa Venkataraman","and David Doherty"]},"dayType":"","jeansDay":false}