{"announcements":[{"title":"FIELD TRIP:","content":"8am - 3:15pm: US Diversity Conference"},{"title":"UNITED FOR PUERTO RICO WRISTBAND SALE","content":"Make sure to bring $5.00 to buy a wristband supporting hurricane relief in Puerto Rico today! The bracelets will be on sale in the Breezeway during the morning and lunch."},{"title":"GRAND TETONS & YELLOWSTONE","content":"ADVENTURE JULY 15-21, 2018 - Travel to Wyoming this summer to learn about geology and biodiversity of the Grand Tetons and Yellowstone. All participants will receive one trimester of high school elective science credit for participating, completing a detailed research project, and keeping daily journals and notes. Join us to learn more at an informational meeting on Thursday, December 7, 2017 from 6pm-7pm in STEM Building Room 108 and contact Mrs. Hamill or Mrs. Bradford with questions or for an application. Applications are due to Mrs. Hamill on Friday, December 15, 2017."},{"title":"TURKEY TRAIN","content":"Monday is our annual Turkey Train! Please drop off your 10-12 pound frozen turkey in Founders Court before school. After heading to advisory at 8am, all students should line up alphabetically by advisory along the walkway from Founders Court to the MAC, beginning with freshmen and ending with seniors at the MAC. Please look for your advisory name on the cones along the route. Remember - dress appropriately for the weather, but most importantly, be sure to wear warm, waterproof gloves!"},{"title":"BREAK A LEG WISHES TO THE CAST AND CREW OF “ 1984”","content":"The Upper School Drama Program presents George Orwell's \" 1984 \" this weekend. Performances are at 8pm on Friday and Saturday and 2pm on Sunday. ALL HAIL BIG BROTHER!"},{"title":"TURKEY DAY TRIVIA :","content":"When Abraham Lincoln declared Thanksgiving a national holiday, it was thanks to the tireless efforts of a magazine editor named Sarah Josepha Hale. Her other claim to fame? She also wrote the nursery rhyme, \"Mary Had a Little Lamb.\""}],"birthdays":{"Today":["Ava Mandoli and John Parish"],"Saturday":["Josh Baumgartner and Malon Carter"],"Sunday":["Danielle Kain and Ryan Thompson"]},"dayType":"","jeansDay":true}