{"announcements":[{"title":"RAM-FAMS RETURNING!!","content":"Today during advisory we will meet in Ram-Fam locations in Ram-Fam groups. Attendance will be taken so make sure to go to your assigned location. Locations will be the same as your starting location for your Ram-Fam at the kick-off event at the start of the year. See below for Senior Leaders and locations. If you don't remember either, please openthis spreadsheetand search for your name using Ctrl F:"},{"title":"THE ANNUAL FUND NEEDS YOUR HELP! Tomorrow","content":"We are hosting a Student Thank-a-thon on (November 14) during lunch in the Olson Hall Presentation Room. Bring your laptops and be ready to thank our donors via email for their generous support of MICDS. It's SUPER EASY, fun, and we provide you with pizza, snacks, and drinks! All are welcome and Community Service credits can be earned. We encourage you to RSVP to Laurie Nest at lnest@micds.orgby today at noon, so we can ensure there is enough food. We hope to see you there!"},{"title":"TURKEY TRAIN","content":"Next Monday, November 20, is our annual Turkey Train!  Please drop of your 10-12 pound frozen turkey in Founders Court before school.  After heading to advisory at 8am, all students should line up alphabetically by advisory along the walkway from Founders Court to the MAC, beginning with freshmen and ending with seniors at the MAC.  Please look for your advisory name on the cones along the route.  Remember -dress appropriately for the weather, but most importantly, be sure to wear warm, waterproof gloves!"},{"title":"WARM UP ST. LOUIS","content":"We are collecting gently used or new winter coats and new gloves, mittens, scarves, hats, and socks through Wednesday, December 20. Adult items will go to veterans and homeless served by St. Patrick Center, and youth items (size 4 child through adult) will go to Children's Hospital's Healthy Kids Express Vans and The Little Bit Foundation. Let's help warm up St. Louis!"},{"title":"FREE 1 PERIOD?","content":"stIf you are free during the first period of the day (A Block on Days 1, 2, 4, and 5 and B Block on Days 3 and 6), you must check in with Mr. Calise in the Upper School Office EVERYday. Failure to do so will be reported to your Dean! All grades must check in by8:45am on regular Days 1 and 4 and9:30am on regular Days 2, 3, 5, and 6.On Late Start days, students must check in by 9:30am. More than two missed or (unexcused) late sign-ins will result in a forfeiture of your privileges!"}],"birthdays":{"Today":["Nikki Garaygay"]},"dayType":"FIRST DAY OF T2","jeansDay":false}