{"announcements":[{"title":"Collaborative Work and Activities Period","content":" 12:10 – 12:50 Department Meetings for World Lang/English/History and Collaborative Work for all others 12:55 – 1:40 Activities or Collaborative Work"},{"title":"A  C  T I V I T I E S P E R I O D M E E T I N  G  S : 1 2 : 5 5 p m - 1 : 4 0 p m :","content":" M e e t i n g S p o n s o r L o c a t i o n Arts Club and Council D’Addario BAST1 Blankets for Babies White/Scheer Blanke BSU Bey Orthewein Chess Club Little STEM 204 Debate Team Mahaffey Olson 221 Fall Athletic Surveys Newman Film Room - North Gym JSU Federman College Counseling Conference Room Programming Club Gaw STEM 252 Science Olympiad Gaw STEM 114 Yearbook Voss/Williamson College Counseling Classroom"},{"title":"1 2 : 5 5 p m - 1 : 1 5 p m :","content":" M e e t i n g S p o n s o r L o c a t i o n I n t e r n a t i o n a l  C  o u n c i l  C  o - H e a d s H a m i l l / H u e w e M a y 1 3"},{"title":"1 : 2 0 p m - 1 : 4 0 p m","content":" M e e t i n g S p o n s o r L o c a t i o n I n t e r n a t i o n a l  C  o u n c i l H a m i l l / H u e w e M a y 1 3 Mock Trial Roth/Wells Olson 219"},{"title":"EARLY DISMISSAL :","content":" Girls Varsity Field Hockey @ 2:35"},{"title":"FIELD TRIP :","content":" Identity 7:45am-1:00pm"},{"title":"MOCK TRIAL INFO SESSION :","content":" During the second half of activities period on Thursday 10/26, Mock Trial Coaches will hold a brief info session for students interested in joining the Mock Trial team. The season starts in November and ends in February/March. If you'd like to learn more about what it is, what it's like to be a lawyer or witness, and what we'll do this season, please come to Olson 219 to learn more.You'll also get details for the upcoming kickoff event."},{"title":"VERIFICATION OF SERVICE HOURS IN x2VOL :","content":" If you have entered hours into x2VOL that have not been verified by your service supervisor, please reach out to him or her to (1) find the email from x2VOL to verify them or (2) send you an email verifying the number of hours you volunteered that you can forward this email verification to on to Mrs. Hamill. If you ask your supervisor to find the email to verify the hours, please tell him or her the sender is \"Volunteer Verification\" and the subject is \"Service Hour Verification.\""},{"title":"SPHERO MAZE CHALLENGE :","content":" Today is the day! Teams, please bring your programs to the US library during Activities period. We will take one team at a time to run your programs and see if you can get Sphero home. There will be prizes to the team that gets Sphero home! See you tomorrow!"},{"title":"BASEBALL :","content":" On Monday 10/30 at 6:00p in Brauer Hall, there will be a brief informational meeting for those interested in playing baseball. Anyone interested in trying out next spring should plan to attend. Parents are welcome and encouraged to attend. See Coach Canavan for more details."}],"birthdays":{}}